[
    {
        "error": 0,
        "message": "Invalid user input: empty field detected",
        "description": "Input validation failed due to one or more fields being left empty. Please ensure all required fields are properly filled before submission."
    },
    {
        "error": 1,
        "message": "Unsupported media format: please try another file type",
        "description": "The media you provided has an unsupported format for image or video media or corrupted. Kindly upload a compatible file type as listed in the documentation."
    },
    {
        "error": 2,
        "message": "Image too large: maximum size exceeded",
        "description": "Provided image exceeds the allowed size limit (>30MB). Please resize or compress the image before uploading. Visit: https://chsweb.vercel.app/docs?search=Media%20Format"
    },
    {
        "error": 3,
        "message": "Failed to compress image: unknown compression error",
        "description": "Image compression process encountered an unexpected issue. Please try again later or verify the image format and quality settings."
    },
    {
        "error": 6,
        "message": "Video processing failed: unsupported video codec",
        "description": "Unable to process video due to an unsupported codec. Use standard encoding formats such as H.264. Refer: https://chsweb.vercel.app/docs?search=videocodec"
    },
    {
        "error": 7,
        "message": "Image to PDF conversion failed: unable to generate PDF",
        "description": "Conversion failed during the PDF generation phase. Please ensure the image(s) is in a valid format and try again."
    },
    {
        "error": 8,
        "message": "Invalid video format: only MP4, AVI, and MOV are supported",
        "description": "Uploaded video format is not supported. Please use one of the following: MP4, MKV, AVI, or MOV, WEBM or any other listed formate and size. Visit: https://chsweb.vercel.app/docs?search=Media%20Formate"
    },
    {
        "error": 9,
        "message": "Video too large: maximum size exceeded",
        "description": "Provided video exceeds the size limit defined by the system (>400MB). Please compress the video before uploading. Visit: https://chsweb.vercel.app/docs?search=Media%20Format"
    },
    {
        "error": 10,
        "message": "Failed to extract frames from video: unknown error",
        "description": "An unexpected error occurred while extracting video frames. Please retry or check if the video format is supported and completing all define rules."
    },
    {
        "error": 12,
        "message": "Image upload failed: unable to upload image to server",
        "description": "An error occurred during the image upload. Please ensure your internet connection is stable or image to base64 string slice converted perfectly, and try again."
    },
    {
        "error": 13,
        "message": "Video upload failed: unable to upload video to server",
        "description": "An error occurred while uploading the video. Please verify your network connection or image to base64 string slice converted perfectly, and try again."
    },
    {
        "error": 14,
        "message": "Image resizing failed: unable to resize image",
        "description": "Image resizing process failed. Please verify image integrity and format before attempting again."
    },
    {
        "error": 19,
        "message": "Video formatting failed: unable to format video",
        "description": "Formatting operation failed on the provided video. Ensure the video format is valid and supported before retrying."
    },
    {
        "error": 22,
        "message": "Image size under conditions: unable to resize image",
        "description": "Unable to resize image due to not meeting the size conditions. Ensure the input meets minimum or maximum image requirements with define format."
    },
    {
        "error": 23,
        "description": "Failed to process most recent task, You are in hosted mode but CHS API not connected with system, Try again later or report it",
        "message": "Task processing halted: CHS API integration is not active in hosted mode. Check your API bindings or consult documentation here: https://chsweb.vercel.app/docs?search=integration"
    },
    {
        "error": 24,
        "description": "Failed to process most recent task, CHS API refused to connected with this system, Try again later or Check CHS API is working or not manually",
        "message": "Request denied: CHS API refused connection with current system setup. Please check the service status or test connectivity manually."
    }
]